КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ДФ_Титул1/КонтурЛогистика_ДФ_Титул1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ДФ_Титул1</name>
  <posting>Deny</posting>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ДФ</name>
    <comment>(из пула!) Выдается ГИС ЭПД Уникальный идентификатор документа заказа (заявки)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфФт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфФт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Составитель</name>
    <comment>Сведения о лице, составителе Т1 ДФ</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрахтователь</name>
    <comment>Фрахтователь</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрахтовщик</name>
    <comment>Фрахтовщик</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПассажиры</name>
    <comment>иначе грузы Принимает значение: 0 – перевозка груза с сопровождением представителя грузовладельца, перевозка груза, в отношении которого не ведется учет движения товарно-материальных ценностей   |1 – перевозка пассажиров и багажа по заказу</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КругЛицОпределен</name>
    <comment>если ЭтоПассажиры</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыДопущены</name>
    <comment>ДопускПсжр Порядок допуска пассажиров для посадки в транспортное средство, установленный с учетом требований, предусмотренных правилами перевозок пассажиров (в случае, если транспортное средство предоставляется для перевозки определенного круга лиц)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТСТип</name>
    <comment>Тип предоставляемого транспортного средства (при необходимости – количество транспортных средств)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполненияПеревозки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПодачи</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяПодачи</name>
    <comment>Дата и время подачи ТС</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутМашиночитаемый</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>для себя, не отправим в документе</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИныеУсловия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлатСтУсл</name>
    <comment>СтУсл</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатРасхПлатДор</name>
    <comment>РасхПлатДор</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатРасхТамПош</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатРасхПром</name>
    <comment>РасхПром</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатРазмерПлат</name>
    <comment>РазмерПлат</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатРасчет</name>
    <comment>Расчет</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодпис</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.КонтурЛогистика_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество в терминах документа 1С (до конвертации)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаЕдиницаИзмерения</name>
      <type>
        <types>DefinedType.КонтурЛогистика_УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Учитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузочноеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеГруза</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидТары</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <comment>необязательное поле</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемКубМ</name>
      <comment>Необязательное поле</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаПлановаяБруттоКг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаПлановаяНеттоКг</name>
      <comment>необязательная, обязательная - Брутто</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаТарыКг</name>
      <comment>необязательная</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <comment>необязательное поле</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопИнформация</name>
      <comment>ИнфГруз (необязательное поле)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъявленнаяЦенность</name>
      <comment>Стоимость (ценность) груза с налогом - всего</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъявленнаяЦенностьВалюта</name>
      <comment>Стоимость (ценность) груза с налогом - всего</comment>
      <type>
        <types>DefinedType.КонтурЛогистика_Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Плотность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозможностьРаспределения</name>
      <comment>ВозмРаспр Возможность распределения груза для соблюдения допустимой нагрузки по осям транспортных средств</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_УИДыГИС/КонтурЛогистика_УИДыГИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_УИДыГИС</name>
  <comment>Хранит пул доступных для использования УИДов минтранса</comment>
  <resources>
    <name>Использован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОперации</name>
    <comment>Дата операции добавления / использования</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ДФ_Титул1/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ = Ложь 
		И Не ЗначениеЗаполнено(УИД_ДФ)
		И Не КонтурЛогистика_ОбработкаДокументовСервер.ЭтоВходящийДокумент(ДополнительныеСвойства) 
		И ЗначениеЗаполнено(Фрахтователь) Тогда
		
		Организация = КонтурЛогистика_ОбщегоНазначенияСервер.ОрганизацияДляЗапросаУИДов(ЭтотОбъект);
		
		ПолученныйУИД = РегистрыСведений.КонтурЛогистика_УИДыГИС.ПолучитьОчередной(Организация);			
		Если ПолученныйУИД <> Неопределено Тогда				
			УИД_ДФ = ПолученныйУИД;				
			ПроверитьИспользованиеУИДа(ПолученныйУИД, Отказ, Организация);			
		Иначе
			Сообщить("Не получен УИД из пула. Закончились?");
		КонецЕсли;
		
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ДФ_Титул1_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// а) Из документа учетной системы 
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	// а1) Из титула5 (водители, сдеавшие ТС дргуим водителям) 
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	// б) загружен из сервиса, создаем из файла обмена
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	// в) ручной ввод Т1 с нуля
	Иначе
		
		ЗаполнитьРеквизитыПоПользователю();
		
	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ДФ_Титул1_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДата();
	УИД_ДФ = "";
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из док Основания

Процедура ЗаполнитьПоДокОснованию(Знач ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		ДокументОснование = ДанныеЗаполнения.ДокументОснование;
		
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			ДанныеЗаполнения.ТипЛогистика, ДанныеЗаполнения.ДокументОснование);
		
		Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
			КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
				ЭтотОбъект, КонтекстНастройкиКонвертации);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			Если ЗначениеЗаполнено(Составитель) Тогда
				ОрганизацияПодписанта = Составитель;
			Иначе
				ОрганизацияПодписанта = Фрахтователь;
			КонецЕсли;
			
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ОрганизацияПодписанта,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из пришедшего файла XML

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
	
	СодДФИнфФт 	= XDTO.Документ.СодДФИнфФт; 
	
	ЗаполнитьРеквизитыТитулаИзXDTO(XDTO, СодДФИнфФт);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO, Знач СодДФИнфФт)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	УИД_ДФ 	= КС.XDTO_Вычислить(СодДФИнфФт, "УИД_ДФ");
	
	ДатИнфФт 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO, "Документ.ДатИнфФт"));
	ВрИнфФт 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(XDTO, "Документ.ВрИнфФт"));

	Составитель    = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(КС.XDTO_ПолучитьЗначениеСвойства(СодДФИнфФт, "СвЛицПЛ"));
	
	МестоОтправления	= КС.Конвертировать_АдресПользТип2023_вПунктМаршрутаЛогистика(КС.XDTO_ПолучитьЗначениеСвойства(СодДФИнфФт, "МестОтпр"));
	
	КС.ЗаполнитьДополнительныхПолучателей(XDTO, ЭтотОбъект);
	КС.ЗаполнитьИнфПолИзXDTO(КС.XDTO_Вычислить(СодДФИнфФт, "ИнфПол"), ЭтотОбъект);

	// подписант
	
	ТипПодпис_raw = КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.ТипПодпис");
	ТипПодпис = Перечисления.КонтурЛогистика_ТипыПодписи.ЗначениеИзXDTO(ТипПодпис_raw);
	
	СпосПодтПолном_raw = КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.СпосПодтПолном");
	СпосПодтПолном = Перечисления.КонтурЛогистика_СпособыПодтвержденияПолномочий.ЗначениеИзXDTO(СпосПодтПолном_raw);
	
	Должность 	= КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.Должн");
	
	Фамилия 	= КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.ФИО.Фамилия");
	Имя 		= КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.ФИО.Имя");
	Отчество 	= КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.ФИО.Отчество");
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Генерация xml

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ДФ_Титул1.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	ДатИнфФт = ТекущаяДатаСеанса();
	ВрИнфФт = ТекущаяДатаСеанса();
	
	Попытка
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфФт, ВрИнфФт);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ДФ_Титул1,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфСоб и ВрИнфСоб
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = "Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить(ТекстОшибки);
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	НомерТитула = 1;
	Формат = "5.01";
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула, Формат, "__DF");
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(Составитель) Тогда 
		ОтправительФайла = Составитель;
	Иначе
		ОтправительФайла = Фрахтователь;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайла); 	
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаДФ(НомерТитула, 
												ОтправительФайла,
												Фрахтовщик,
												GUID);
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
												
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ОтправительФайла, ПользовательПодписант, Дата, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_ПодпИнф(НомерТитула, "__DF", Формат, ПодписантСтруктура);
	Если ЗначениеЗаполнено(ПодписантСтруктура.МЧД) И ПодписантСтруктура.СпосПодтПолном = "3" Тогда 
		Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
	КонецЕсли;
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, "__DF", Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	КС.XDTO_Установить(XDTO_Файл.Документ, "Функция", 		?(ЭтоПассажиры, "1", "0"));
	Если ЗначениеЗаполнено(Составитель) Тогда 
		КС.XDTO_Установить(XDTO_Файл.Документ, "НаимЭкСубСост", Составитель.НаименованиеОрганизацииПолное);
		КС.XDTO_Установить(XDTO_Файл.Документ, "ОснДовОргСост", КС.XDTO_РеквДокТипПоСсылкеДоговору(НомерТитула, ОснДовОргСост, "__DF", Формат));
	Иначе
		КС.XDTO_Установить(XDTO_Файл.Документ, "НаимЭкСубСост", Фрахтователь.НаименованиеОрганизацииПолное);
	КонецЕсли;

	XDTO_СодДФИнфФт = КС.XDTO_ДФ_СодДФИнфФт(НомерТитула, Формат, Ссылка);
	
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодДФИнфФт", XDTO_СодДФИнфФт);
	
	// TODO
	// иные поля
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьИспользованиеУИДа(ПолученныйУИД, Отказ, Организация)
	
	УспешноОтметилиИспользованиеУИД = РегистрыСведений.КонтурЛогистика_УИДыГИС.ОтметитьИспользованным(УИД_ДФ, Организация);
	Если Не УспешноОтметилиИспользованиеУИД Тогда
		
		Отказ = Истина;
		Сообщить("УИД из пула был использован другим документом, попробуйте повторить операцию");
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецЕсли
